[
  {
    "path": "posts/2025-03-07-ses-and-weight-perception/",
    "title": "SES and Weight Perception",
    "description": "How is socioeconomic status (SES) associated with an individual's perceptions of their own weight?",
    "author": [
      {
        "name": "Songyi Ahn",
        "url": {}
      }
    ],
    "date": "2025-03-10",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n\n\n\n\n\n\nFinal Plot\nThis plot was created to investigate the association between socioeconomic status (SES) and individuals’ perceptions about their own weight, regardless of their BMI. In today’s world where thinness and lean body are considered ideal social values, whether a lean body functions as a capital to maintain SES or not is an interesting topic.\n\n\n\nData Source: NHANES 2017-March 2020\nThe finalized plot is a boxplot. SES was categorized into two groups in this boxplot: low and high. Individuals below the 25th percentile are classified as low SES, while those above the 75th percentile are classified as high SES. The plot also compares the BMI of people who perceive themselves as overweight, of the right, or underweight within each SES group. The visualization shows that among those who consider themselves overweight, individuals with low SES have higher BMIs than those with high SES. In other words, people with high SES tend to have a stricter perception of their own weight. A similar pattern was observed among those who perceive themselves as being of the right weight or underweight.\nThe intended audience for this plot is health-related social science researchers. Since the box plot is a data visualization method frequently used by social scientists, there will not be much difficulty in interpreting it. For researchers interested in topics such as health and social class, this plot will be insightful to study how weight, body shape, and health status function within social class structures.\nDrafts\n\nDraft 1\nDraft 2\n\n\n(Click the Draft buttons to view previous plots)\n\n\n\n\nThere were dynamic changes in plots until this final plot was completed. The first draft used a jitter plot to spread out the overlapping dots. The dots were color-coded depending on the individual’s weight perception, but the jitter plot was too messy to interpret effectively. Accordingly, the second draft changed it to a scatter plot that could reduce the number of dots and applied a color scale that was considerate of color-blind audiences. Regression lines were also added to visualize the trend, but it was still difficult to interpret intuitively. Finally, the box plot was adopted, incorporating information of medically relevant BMI categories. The final version of the plot was able to convey the intended message most clearly and effectively.\n\n\n\n",
    "preview": "posts/2025-03-07-ses-and-weight-perception/ses-and-weight-perception_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2025-03-14T19:23:11-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-03-07-ses-and-calorie-check-for-weight/",
    "title": "SES and Calorie Check for Weight",
    "description": "How is socioeconomic status (SES) associated with the frequency of calorie label checking for weight management?",
    "author": [
      {
        "name": "Songyi Ahn",
        "url": {}
      }
    ],
    "date": "2025-03-09",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n\n\n\n\n\n\nFinal Plots\nThese plots were created to examine how socioeconomic status (SES) is associated with the frequency of calorie label checking for weight management. People who want to control their weight often check calorie information when purchasing food. If the frequency of this behavior differs by SES, it could suggest that certain SES groups are more engaged in weight management. For this analysis, I created two final plots, which categorized SES into three groups: low, middle, and high. Individuals below the 25th percentile are classified as low SES, those above the 75th percentile as high SES, and those in between as middle SES.\nFirst, the heatmap illustrates the total number of responses regarding how often individuals check the calories on food labels by SES group. Darker colors, such as dark red and black, indicate a higher number of responses, while lighter colors represent fewer responses. The ‘rocket’ color option is part of the viridis scale, transitioning from light to dark in a gradient. It is colorblind-friendly while effectively representing value differences in an ordered manner. The heat map shows that more people check calories than those who do not across all SES groups. The “most of the time” and “sometimes” columns of the middle SES group are the darkest, indicating that the middle class uses calorie checks most frequently. However, since it is not easy to directly compare the extent of calorie label checks within SES groups in the heat map, an additional bar graph was created.\n\n\n\n\n\n\nData Source: NHANES 2017-March 2020\nThis bar graph displays the percentage distribution of calorie labels checking frequency across SES groups. The bar graph reveals that individuals in the high SES group have the highest rates of checking calorie labels for “always” and “most of the time”, followed by those in the middle and low SES groups. Meanwhile, the low SES group has the highest proportion of individuals who “rarely” or “never” check calories. Therefore, it can be seen that the higher the SES, the more often they check calories on food labels for weight control.\nThe intended audiences for these plots are public health policymakers and people in the health and food industries. By seeing the differences in calorie label checking across SES groups, they could develop tailored weight management programs or design food packaging that emphasizes different health benefits or nutritional information in particular products that are more likely to be consumed by certain SES groups.\nDrafts\n\nDraft 1\nDraft 2\n\n\n(Click the Draft buttons to view previous plots)\n\n\n\n\nBefore finally adding the bar graph, creating a heatmap was the main challenge. The first draft used a binned heatmap that divided the SES groups based on raw SES scores. However, in the second draft, quantiles were used to better reflect the distribution of respondents, converting it into a regular heatmap. originally a white-to-blue gradient was used for the color scheme, which could be hard for some people to read. After changing the colors into the color-blind-friendly palette, titles and labels were added to enhance clarity. Additionally, the first draft used the original dataset coded “always” as 1 and “never” as 5, which was not intuitive. Then the numerical codes were replaced with descriptive labels, the order was reversed in the second draft. This order was maintained through to the final version of plots to improve readability and interpretation: as the values go up, it indicates more frequent calorie-checking behavior.\n\n\n\n",
    "preview": "posts/2025-03-07-ses-and-calorie-check-for-weight/ses-and-calorie-check-for-weight_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2025-03-14T19:21:26-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-03-08-ses-and-weight-loss-behavior/",
    "title": "SES and Weight Loss Behavior",
    "description": "How is socioeconomic status (SES) associated with engagement in various weight loss behaviors?",
    "author": [
      {
        "name": "Songyi Ahn",
        "url": {}
      }
    ],
    "date": "2025-03-08",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n\n\n\n\n\n\nFinal Plot\nSince differences in SES can lead to differences in the methods individuals use to lose weight, this plot aims to explore how socioeconomic status (SES) is linked with engagement in various weight loss behaviors.\n\n\n\nData Source: NHANES 2017-March 2020\nThe finalized plot is a ridgeline plot. In this plot, SES is treated as a continuous variable using raw scores, indicating higher scores as higher SES. Each mountain-shaped figure shows how the distribution of SES changes depending on the weight loss method. Weight loss behaviors were classified into five categories: exercise, change diet, eat less, get professional help, and perform risky behaviors. Risky behaviors include taking non-prescription pills such as laxatives, vomiting, and smoking. Each behavior is represented by a different color using a categorical color palette designed to be colorblind-friendly.\nThe plot shows that, overall, as SES increases, individuals engage more in all weight loss behaviors. In particular, seeking help from professionals, which requires financial resources and health insurance, was significantly more common among those with higher SES and much less frequent among those with lower SES. Moreover, the distribution of the low SES group was much denser in the case of harmful behaviors. This highlights a concerning trend: individuals with limited economic and health insurance support and lower levels of education may be more vulnerable to engaging in risky weight loss practices.\nThe intended audience for this plot includes public health professionals, as well as medical experts. By understanding the relationship between weight loss behaviors and SES, they can develop policies to strengthen health education and create public health interventions. It could be also helpful in providing customized treatment approaches to prevent individuals with low SES from using harmful weight loss methods.\nDrafts\n\nDraft 1\nDraft 2\n\n\n(Click the Draft buttons to view previous plots)\n\n\n\n\nThroughout the development process, the ridgeline plot has been refined to clearly convey the intended messages. The first draft successfully visualized the data, but it lacked color distinction, and the labels for each axis were not neatly written. In the second draft, different colors were applied to each behavior and labels for each axis and element were written on the graphs. However, both the legend and individual graphs displayed behavior labels, which made the plot somewhat distracting. In the final plot, therefore, weight loss behavior labels were placed only on one side of the y-axis to maintain simplicity while ensuring clarity. Detailed caption was added to clarify the meaning of harmful behaviors.\n\n\n\n",
    "preview": "posts/2025-03-08-ses-and-weight-loss-behavior/ses-and-weight-loss-behavior_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2025-03-14T18:29:31-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-03-08-ses-and-dining-location/",
    "title": "SES and Dining Location",
    "description": "How is socioeconomic status (SES) associated with individuals choices of dining locations?",
    "author": [
      {
        "name": "Songyi Ahn",
        "url": {}
      }
    ],
    "date": "2025-03-07",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n\n\n\n\n\n\nFinal Plot\nThis plot was generated to look into how socioeconomic status (SES) is related to individuals’ choice of dining location. The choice of dining location is influenced not only by the cost of meals but also by the types of food offered and their impact on weight.\n\n\n\nData Source: NHANES 2017-March 2020\nThe finalized plot is a mosaic plot. SES was categorized into two groups in this boxplot: low and high. Individuals below the 25th percentile are classified as low SES, while those above the 75th percentile are classified as high SES. Each box in the mosaic visually represents the proportion of dining locations chosen by SES group. The labels written above them indicate the percentage of individuals within each SES group who selected that dining location.\nThe low SES group ate the most at fast food restaurants, while the high SES group ate the most at restaurants with servers. In addition, the high SES group had the least experience eating at all-you-can-eat buffets, where diners can eat as much as they want without restrictions. In today’s society, where fast food places are common dining choices, the overall rate of eating at fast food places was high across both SES groups. Still, the rate was higher in the low SES group than in the high SES group. In contrast, the rate of eating at a restaurant with a server was higher in the high SES group than in the low SES group.\nFast food places often serve junk food that is not helpful for weight loss. Meanwhile, restaurants with a server are more advantageous for those managing their weight as they offer greater flexibility in adjusting ingredients and menu options according to individuals’ dietary needs. Therefore, this plot shows that there are differences in dining location choice depending on SES.\nThe intended audience for this plot is medical, nutrition experts, and public health professionals. They can consider that there are differences in dining location associated with SES levels. They could provide their patients or customers more detailed dietary counseling based on that and develop policies such as subsidies for healthier restaurant options and expanded access to fresh food at fast food places.\nDrafts\n\n\nDraft 1\n\n\nDraft 2\n\n\n\n(Click the Draft buttons to view previous plots)\n\n\n\n\nThe plot went through several revisions before reaching the final mosaic plot. The first draft divided the SES groups into three, but it was decided that using only two groups would more clearly illustrate the differences in dining location choices based on SES. In the second draft, thus, SES was categorized into two groups and gave each plot element an appropriate label. However, dividing SES exactly in half made the plot resemble a general stacked bar chart, not fully utilizing the strengths of a mosaic plot. To address this, SES groups were re-categorized according to the quantiles in the final version. Also, in earlier drafts, the color order of the legend was reversed compared to the plot, which was corrected in the final version for consistency. Lastly, in the last plot, unnecessary grid lines were removed and the percentages were displayed as numerical labels to enhance clarity.\n\n\n\n",
    "preview": "posts/2025-03-08-ses-and-dining-location/ses-and-dining-location_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2025-03-14T19:19:10-07:00",
    "input_file": {}
  }
]
